### DataFrame Groupby

In [33]:
import pandas as pd
import numpy as np

In [34]:
# Create lists of lists, grades and number one column
location_list = ['Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando','Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando','Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando']
state_list = ['TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL','TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL','TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL']
name_list = ['Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda','Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda','Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda']
lastname_list = ['Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins','Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins','Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins']
challenge_grades = [100,88,100,100,55,75,81,77,32,100,30,99.0,95.0,99,100.0,60.0,86.0,83.0,45.0,75.0,95.0,0.0,70.0,100.0,88,100.0,90.0,65,55.0,81.0,99.0,81.0,75.0]
challenge_number = [1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3]

# Create dictionary of lists
class_data = { 'location': location_list,
               'state': state_list,
               'name': name_list,
               'lastname': lastname_list,
               'challenge_grades': challenge_grades,
               'challenge_number': challenge_number}

In [35]:
# create df
df = pd.DataFrame(data=class_data)
df.head(15)

       location state     name  lastname  challenge_grades  challenge_number
0        Austin    TX     Juan  Martinez             100.0                 1
1        Austin    TX    Ellie     Smith              88.0                 1
2   San Antonio    TX   George    Garcia             100.0                 1
3        Laredo    TX    Maria     Logit             100.0                 1
4        Dallas    TX     Test   Account              55.0                 1
5       El Paso    TX     Gina    Perdue              75.0                 1
6       Chicago    IL   Andrew   Lablanc              81.0                 1
7    Naperville    IL      Joe      Dile              77.0                 1
8   Springfield    IL     Mary     Smith              32.0                 1
9         Miami    FL  Tabelon   Legruti             100.0                 1
10      Orlando    FL     Wuda   Jenkins              30.0                 1
11       Austin    TX     Juan  Martinez              99.0                 2
12       Austin    TX    Ellie     Smith              95.0                 2
13  San Antonio    TX   George    Garcia              99.0                 2
14       Laredo    TX    Maria     Logit             100.0                 2

### Value Counts

In [48]:
# Get counts by state
df['state'].value_counts()

TX    18
IL     9
FL     6
Name: state, dtype: int64

In [47]:
# Get counts by state, location
df[['state','location']].value_counts()

state  location
TX     Austin         6
FL     Miami          3
       Orlando        3
IL     Chicago        3
       Naperville     3
       Springfield    3
TX     Dallas         3
       El Paso        3
       Laredo         3
       San Antonio    3
dtype: int64

### Group by state

In [38]:
# Counts by state
df.groupby(['state']).count()

       location  name  lastname  challenge_grades  challenge_number
state
FL            6     6         6                 6                 6
IL            9     9         9                 9                 9
TX           18    18        18                18                18

In [39]:
# Show only one column
location_by_count = df.groupby(['state']).count()['location']
location_by_count

state
FL     6
IL     9
TX    18
Name: location, dtype: int64

<img src="images/groupby.jpg" alt="drawing" style="width:900px;"/>

### Group by multiple columns

In [40]:
# Get count by state, location
df.groupby(['state','location'])['challenge_grades'].count()

state  location
FL     Miami          3
       Orlando        3
IL     Chicago        3
       Naperville     3
       Springfield    3
TX     Austin         6
       Dallas         3
       El Paso        3
       Laredo         3
       San Antonio    3
Name: challenge_grades, dtype: int64

In [41]:
# Get mean score by state, location
df.groupby(['state','location'])['challenge_grades'].mean()

state  location
FL     Miami           92.000000
       Orlando         35.000000
IL     Chicago         73.000000
       Naperville      67.666667
       Springfield     68.666667
TX     Austin          92.000000
       Dallas          68.333333
       El Paso         75.333333
       Laredo         100.000000
       San Antonio     95.666667
Name: challenge_grades, dtype: float64

In [44]:
# Get mean score by state, location
df.groupby(['state','location','name'])['challenge_grades'].agg(["max", "min", "mean", "count"])

                             max    min        mean  count
state location    name
FL    Miami       Tabelon  100.0   81.0   92.000000      3
      Orlando     Wuda      75.0    0.0   35.000000      3
IL    Chicago     Andrew    83.0   55.0   73.000000      3
      Naperville  Joe       81.0   45.0   67.666667      3
      Springfield Mary      99.0   32.0   68.666667      3
TX    Austin      Ellie    100.0   88.0   94.333333      3
                  Juan     100.0   70.0   89.666667      3
      Dallas      Test      90.0   55.0   68.333333      3
      El Paso     Gina      86.0   65.0   75.333333      3
      Laredo      Maria    100.0  100.0  100.000000      3
      San Antonio George   100.0   88.0   95.666667      3